package community;

public class Alps {

	public static void main(String[] args) {
		String exam1 = 
"GHZ로 동작하는 CPU가 있어 기계어의 1명령을 평균 0.8clock로 실행할수 있다는 것을 알고있다\n"+
"이CPU는 1초에 약 몇만 명령을 실행할수 있는가?\n"+
"CPU의 클럭 속도: \"GHZ\"는 기가헤르츠(1GHz = 10^9 Hz) 단위로, 이는 1초에 몇 번 클럭이 발생하는지를 나타냅니다\n"+
"1GHz의 경우, 1초에 10억 클럭이 발생합니다\n."+
"명령 실행 시간: 각 명령이 평균적으로 0.8 클럭 사이클을 사용한다고 했으므로,\n"+
"1초에 실행할 수 있는 명령 수는 1초 동안의 클럭 수를 0.8로 나눈 값입니다.\n"+
"1GHz = 1초에 \r\n"
+ "1\r\n"
+ "0\r\n"
+ "9\r\n"
+ "10 \r\n"
+ "9\r\n"
+ " 클럭이 발생\n"
+"(즉, 12억 5천만 명령)\n"
+"1.25×10 입니다";
	}
}
